<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 2.1.1 
# *Data Wrangling and Munging with Pandas*

## Part 1: Wrangling Data

The term "data wrangling" is analogous to capturing wild horses and getting them into a fenced area; the horses are data and the fencing is your computer. The more common data wrangling tasks include:

- reading flat files
- reading Excel files
- downloading from web pages
  - csv
  - html
  - json

In [2]:
import numpy as np
import pandas as pd

*It is good practice to display the library version numbers for future reference:*

In [ ]:
print('Numpy: ', np.__version__)
print('Pandas: ', pd.__version__)

### CSV Files

Below are three attempts to load the file "bikeshare.csv" into a DataFrame named `bikes`. Why are they wrong?

In [2]:
# wrong:
bikes = pd.read_table(r'~\Documents\IOD-testing\DATA\bikeshare.csv', delimiter=',',header = None)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table(r'~\Documents\IOD-testing\DATA\bikeshare.csv', delimiter=',',header = 1)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table(r'~\Documents\IOD-testing\DATA\bikeshare.csv', delimiter=',',header = 0)
print(bikes.head())

        0           1       2   3     4   5        6        7           8   \
0  instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday
1        1  2011-01-01       1   0     1   0        0        6           0
2        2  2011-01-01       1   0     1   1        0        6           0
3        3  2011-01-01       1   0     1   2        0        6           0
4        4  2011-01-01       1   0     1   3        0        6           0

           9     10      11    12         13      14          15   16
0  weathersit  temp   atemp   hum  windspeed  casual  registered  cnt
1           1  0.24  0.2879  0.81          0       3          13   16
2           1  0.22  0.2727   0.8          0       8          32   40
3           1  0.22  0.2727   0.8          0       5          27   32
4           1  0.24  0.2879  0.75          0       3          10   13

   1  2011-01-01  1.1  0  1.2  0.1  0.2  6  0.3  1.3  0.24  0.2879  0.81  \
0  2  2011-01-01    1  0    1    1    0  6    0    1  0.22  0.2727  0.80
1  3  2011-01-01    1  0    1    2    0  6    0    1  0.22  0.2727  0.80
2  4  2011-01-01    1  0    1    3    0  6    0    1  0.24  0.2879  0.75
3  5  2011-01-01    1  0    1    4    0  6    0    1  0.24  0.2879  0.75
4  6  2011-01-01    1  0    1    5    0  6    0    2  0.24  0.2576  0.75

      0.4  3  13  16
0  0.0000  8  32  40
1  0.0000  5  27  32
2  0.0000  3  10  13
3  0.0000  0   1   1
4  0.0896  0   1   1

   instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday  \
0        1  2011-01-01       1   0     1   0        0        6           0
1        2  2011-01-01       1   0     1   1        0        6           0
2        3  2011-01-01       1   0     1   2        0        6           0
3        4  2011-01-01       1   0     1   3        0        6           0
4        5  2011-01-01       1   0     1   4        0        6           0

   weathersit  temp   atemp   hum  windspeed  casual  registered  cnt
0           1  0.24  0.2879  0.81        0.0       3          13   16
1           1  0.22  0.2727  0.80        0.0       8          32   40
2           1  0.22  0.2727  0.80        0.0       5          27   32
3           1  0.24  0.2879  0.75        0.0       3          10   13
4           1  0.24  0.2879  0.75        0.0       0           1    1

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

?:
ANSWER: Case 1 treats headings as just another data row. Case 2 treats the 1st data row as the column header. Case 3 gets the header right (row 0), but reads each row as a single column (Nb. the other two make that same mistake).

Load the file "bikeshare.csv" into a DataFrame named `bikes`, and confirm that it was loaded properly:

In [85]:
#ANSWER:
bikes= pd.read_csv(r'~\Documents\IOD-testing\DATA\bikeshare.csv')
bikes.head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1

Note that we could have used `read.csv()` above. When is `read_table()` necessary?

?:
ANSWER: When `sep` is not the comma character, or we need fine control that `read.csv()` does not provide.

Flat files can be full of surprises. Here are some issues to watch out for:

- separator character is something other than the comma
  - ";", "|", and tab are popular
- newline character is something other than what the O/S expects 
  - Tip: Don't hard-code the character codes for carriage returns, linefeeds, etc. Use Python's built-in representation instead (e.g. Python translates "\n" to the newline character and "\t" to the tab character on any O/S).
- truncated lines
  - if there are empty fields at the end of a line it is possible that their separators will be missing, resulting in a "jagged" file
- embedded commas or quotes
  - a free-text field containing embedded commas may split into separate fields on input
  - a free-text field containing embedded quotes may not parse correctly
- unescaped characters
  - the "\" character indicates a control code to Python, which will break the I/O
    - e.g. the substring "\u0123" will be interpreted as Unicode(0123) -- which may not be what the file creator intended
  - these may need to be fixed by loading whole strings and then parsing into a new data frame
  
Tip: Most issues can be delth with by correctly specifying the parameters of the function you use to load the file. Read the doco before reading the data!

### Reading Excel Files

In [ ]:
from pandas import ExcelFile  # Nb. Need to install xlrd from conda (it does not automatically install with pandas)

In [11]:
df = pd.read_excel(r'~\Documents\IOD-testing\DATA\Iris.xls', sheet_name = 'Data')
df

,Species_No,Petal_width,Petal_length,Sepal_width,Sepal_length,Species_name
0,1,0.2,1.4,3.5,5.1,Setosa
1,1,0.2,1.4,3.0,4.9,Setosa
2,1,0.2,1.3,3.2,4.7,Setosa
3,1,0.2,1.5,3.1,4.6,Setosa
4,1,0.2,1.4,3.6,5.0,Setosa
...,...,...,...,...,...,...
145,3,2.3,5.2,3.0,6.7,Verginica
146,3,1.9,5.0,2.5,6.3,Verginica
147,3,2.0,5.2,3.0,6.5,Verginica
148,3,2.3,5.4,3.4,6.2,Verginica
149,3,1.8,5.1,3.0,5.9,Verginica

So, this file appears to have an embedded table of aggregates on the same sheet as the raw data (a naughty but common practice amongst analysts).

It is usually better to load data correctly than to meddle with the source file or load it 'warts and all' and then try to parse it in code. The Pandas functions for reading files have parameters that provide the control we need. For ecxample, we could make multiple calls to `read_excel()`, using combinations of the `header`, `usecols`, `skiprows`, `nrows`, and `skipfooter` parameters to load one table at a time from a spreadsheet with multiple tables.

Load the above file without the unwanted columns:

In [56]:
#ANSWER
df = pd.read_excel(r'~\Documents\IOD-testing\DATA\Iris.xls', sheet_name = 'Data',usecols=[0,3,4,5])
df

     Species_No  Sepal_width  Sepal_length Species_name
0             1          3.5           5.1       Setosa
1             1          3.0           4.9       Setosa
2             1          3.2           4.7       Setosa
3             1          3.1           4.6       Setosa
4             1          3.6           5.0       Setosa
..          ...          ...           ...          ...
145           3          3.0           6.7    Verginica
146           3          2.5           6.3    Verginica
147           3          3.0           6.5    Verginica
148           3          3.4           6.2    Verginica
149           3          3.0           5.9    Verginica

[150 rows x 4 columns]

In [67]:
df.groupby(by=['Species_No','Species_name']).size()

Species_No  Species_name
1            Setosa         50
2            Versicolor     50
3            Verginica      50
dtype: int64

In [123]:
df[df.Species_No==1]

    Species_No  Sepal_width  Sepal_length Species_name
0            1          3.5           5.1       Setosa
1            1          3.0           4.9       Setosa
2            1          3.2           4.7       Setosa
3            1          3.1           4.6       Setosa
4            1          3.6           5.0       Setosa
5            1          3.9           5.4       Setosa
6            1          3.4           4.6       Setosa
7            1          3.4           5.0       Setosa
8            1          2.9           4.4       Setosa
9            1          3.1           4.9       Setosa
10           1          3.7           5.4       Setosa
11           1          3.4           4.8       Setosa
12           1          3.0           4.8       Setosa
13           1          3.0           4.3       Setosa
14           1          4.0           5.8       Setosa
15           1          4.4           5.7       Setosa
16           1          3.9           5.4       Setosa
17           1          3.5           5.1       Setosa
18           1          3.8           5.7       Setosa
19           1          3.8           5.1       Setosa
20           1          3.4           5.4       Setosa
21           1          3.7           5.1       Setosa
22           1          3.6           4.6       Setosa
23           1          3.3           5.1       Setosa
24           1          3.4           4.8       Setosa
25           1          3.0           5.0       Setosa
26           1          3.4           5.0       Setosa
27           1          3.5           5.2       Setosa
28           1          3.4           5.2       Setosa
29           1          3.2           4.7       Setosa
30           1          3.1           4.8       Setosa
31           1          3.4           5.4       Setosa
32           1          4.1           5.2       Setosa
33           1          4.2           5.5       Setosa
34           1          3.1           4.9       Setosa
35           1          3.2           5.0       Setosa
36           1          3.5           5.5       Setosa
37           1          3.6           4.9       Setosa
38           1          3.0           4.4       Setosa
39           1          3.4           5.1       Setosa
40           1          3.5           5.0       Setosa
41           1          2.3           4.5       Setosa
42           1          3.2           4.4       Setosa
43           1          3.5           5.0       Setosa
44           1          3.8           5.1       Setosa
45           1          3.0           4.8       Setosa
46           1          3.8           5.1       Setosa
47           1          3.2           4.6       Setosa
48           1          3.7           5.3       Setosa
49           1          3.3           5.0       Setosa

### Importing Data Directly from the Web

We usually want to store a local copy of a data file that we download from the Web, but when data retention is not a priority it is convenient to download the data directly into our running Python environment.

#### Importing Text Files from the Web

The web is the 'wild west' of data formats. However, we can usually expect good behaviour from files that are automatically generated by a service, such as the earthquake report:

In [84]:
df = pd.read_csv('https://earthquake.usgs.gov/earthquakes/feed/v1.0/summary/2.5_hour.csv')
df.head()

,time,latitude,longitude,depth,mag,magType,nst,gap,dmin,rms,...,updated,place,type,horizontalError,depthError,magError,magNst,status,locationSource,magSource
0,2022-11-21T01:53:07.980Z,-20.5564,-177.5988,484.645,4.3,mb,39,76,2.322,0.51,...,2022-11-21T02:17:53.040Z,"256 km WNW of Haveluloto, Tonga",earthquake,6.78,7.582,0.068,61,reviewed,us,us
1,2022-11-21T01:41:04.665Z,-4.9700,100.7146,24.822,4.9,mb,71,71,2.314,0.76,...,2022-11-21T02:13:19.040Z,"215 km SW of Bengkulu, Indonesia",earthquake,6.84,4.408,0.085,44,reviewed,us,us

#### Importing HTML Files from the Web

Working with unstructured HTML files relies heavily on library functions. This one, however, is well-structured:

In [125]:
url = 'https://www.ccra.com/airport-codes/'

df = pd.read_html(url)
df=df[0]

In [89]:
df

                City      Country Code
0            Aalborg      Denmark  AAL
1           Aalesund       Norway  AES
2             Aarhus      Denmark  AAR
3     Abbotsford, BC       Canada  YXX
4     Abbotsford, BC       Canada  YXX
...              ...          ...  ...
1574        Zanzibar     Tanzania  ZNZ
1575        Zaragoza        Spain  ZAZ
1576       Zhengzhou        China  CGO
1577        Zhoushan        China  HSN
1578          Zurich  Switzerland  ZRH

[1579 rows x 3 columns]

In [86]:
df.shape

(1579, 3)

In [ ]:
df.dtypes

In [126]:
df_sort=df.sort_values(by='Country')
df_sort[['Country','City','Code']]

             Country                   City Code
635      Afghanistan                  Kabul  KBL
1417         Albania                 Tirana  TIA
38           Algeria                Algiers  ALG
62           Algeria                 Annaba  AAE
1052  American Samoa     Pago Pago, Tutuila  PPG
...              ...                    ...  ...
690            Zaire              Kisangani  FKI
811           Zambia                 Lusaka  LUN
533         Zimbabwe                 Harare  HRE
207         Zimbabwe               Bulawayo  BUQ
823              NaN  Magdalens Islands, PQ  NaN

[1579 rows x 3 columns]

In [127]:
df['Country'].nunique()

208

In [133]:
df.groupby(['Country'])[['City']]

In [136]:
df[df.Country=='Algeria']

       City  Country Code
38  Algiers  Algeria  ALG
62   Annaba  Algeria  AAE

In [135]:
df.dtypes

City       object
Country    object
Code       object
dtype: object

In [9]:
df.groupby(by='Country').size()

Country
Afghanistan       1
Albania           1
Algeria           2
American Samoa    1
Angola            2
                 ..
Wales             1
Yemen             2
Zaire             3
Zambia            1
Zimbabwe          2
Length: 208, dtype: int64

In [102]:
df[df.Country=='Yemen']

       City Country Code
16     Aden   Yemen  ADE
1251  Sanaa   Yemen  SAH

In [10]:
df['Country'].value_counts()

USA                446
Canada             162
Australia           65
China               53
Mexico              52
                  ...
Sudan                1
Afghanistan          1
Brunei               1
Solomon Islands      1
Armenia              1
Name: Country, Length: 208, dtype: int64

#### Importing XML Files from the Web

XML files are semi-structured, but you're at the mercy of the file creator. If every record has the same format it will be much easier, but practical applications often require a lot of custom code. Here is an example that includes a nice parser class: http://www.austintaylor.io/lxml/python/pandas/xml/dataframe/2016/07/08/convert-xml-to-pandas-dataframe/

#### Importing JSON Files from the Web

Like XML, JSON files are semi-structured and may require work to capture the schema into a dataframe. Here is a simple example:

In [5]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url, orient = 'columns')
df.head()

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0

## Part 2: Data Munging

Data munging is manipulating data to get it into a form that we can start running analyses on (which usually means getting the data into a DataFrame). Before we get to this stage, we may need to remove headers or footers, transpose columns to rows, split wide data tables into long ones, and so on. (Nb. Excel files can be particularly troublesome, because users can format their data in mixed, complex shapes.) Essentially, we need to follow Hadley Wickham's guidelines for tidy datasets (http://vita.had.co.nz/papers/tidy-data.html):

The end goal of the cleaning data process:

- each variable should be in one column
- each observation should comprise one row
- each type of observational unit should form one table
- include key columns for linking multiple tables
- the top row contains (sensible) variable names
- in general, save data as one file per table

### Dataset Morphology

Once we have our dataset in a DataFrame (or Series, if our data is only 1-dimensional), we can start examining its size and content.

How many rows and columns are in `bikes`?

In [140]:
#ANSWER
bikes.shape

(17379, 17)

What are the column names in `bikes`?

In [14]:
#ANSWER
bikes.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

What are the data types of these columns?

In [15]:
#ANSWER
bikes.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

What is the (row) index for this DataFrame?

In [121]:
#ANSWER
bikes.index

RangeIndex(start=0, stop=17379, step=1)

https://www.dataquest.io/blog/python-json-tutorial/

## Slicing and Dicing

It is often preferable to refer to DataFrame columns by name, but there is more than one way to do this. 
Do `bikes['season']` and `bikes[['season']]` give the same object? Demonstrate:

In [126]:
#ANSWER
bikes[['season']]

       season
0           1
1           1
2           1
3           1
4           1
...       ...
17374       1
17375       1
17376       1
17377       1
17378       1

[17379 rows x 1 columns]

In [141]:
bikes['season']

0        1
1        1
2        1
3        1
4        1
        ..
17374    1
17375    1
17376    1
17377    1
17378    1
Name: season, Length: 17379, dtype: int64

How would we use object notation to show the first 4 rows of `atemp`?

In [144]:
#ANSWER
bikes['atemp'][:4]

0    0.2879
1    0.2727
2    0.2727
3    0.2879
Name: atemp, dtype: float64

Algorithms that loop over multiple columns often access DataFrame columns by index. However, none of the following work (try them out by uncommenting / removing the "#E: " ):

In [149]:
#bikes[[0]]
#bikes[0]
#bikes[0,0]
#bikes[[0,0]]

What is the correct way to access the 1st row of the DataFrame by its index?

In [164]:
#ANSWER
bikes.iloc[:1,:]

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16

What is the correct way to access the 2nd column of the DataFrame by its index?

In [175]:
#ANSWER
bikes.iloc[:,[1]]

           dteday
0      2011-01-01
1      2011-01-01
2      2011-01-01
3      2011-01-01
4      2011-01-01
...           ...
17374  2012-12-31
17375  2012-12-31
17376  2012-12-31
17377  2012-12-31
17378  2012-12-31

[17379 rows x 1 columns]

## Handling Missing Values

What is the Pandas `isnull` function for?

?
ANSWER:

We can apply `isnull` to the `bikes` DataFrame to show the result for every element:

In [176]:
bikes.isnull().head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

However, we usually start at a higher level. How many nulls are in `bikes` altogether?

In [180]:
#ANSWER
bikes.isna().all().sum()

0

If this result were nonzero we would next want to find out which columns contained nulls. How can this be done in one line of code?

In [181]:
#ANSWER
bikes.isna().sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

What is the Numpy object `nan` used for? (Write a descriptive answer.)

?
ANSWER: Marking a data point as invalid.

Write (and verify) a function that performs scalar division with built-in handling of the edge case (i.e. return a value instead of just trapping the error):

In [ ]:
#ANSWER

Apply the Pandas `isna` function to the following data objects:

In [4]:
x = 2.3
y = np.nan
print(x, y)

2.3 nan

In [6]:
#ANSWER
pd.isna([x,y])

array([False,  True])

In [8]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
print(array)

[[ 1. nan  3.]
 [ 4.  5. nan]]

In [9]:
#ANSWER
pd.isna(array)

array([[False,  True, False],
       [False, False,  True]])

How is the pandas I/O parameter `na_values` used?

? ANSWER:

## Data Profiling

### Counts

When there are categorical variables in a dataset we will want to know how many possible values there are in each column. (Nb. If the dataset is a sample of a larger one, our sample may not capture all possible values of every categorical.)

How many (different) seasons are in `bikes`?

In [12]:
#ANSWER
bikes['season'].nunique()

4

### Ranges

Print the range of the `instant`, `dteday`, and `windspeed` columns:

In [17]:
#ANSWER
bikes.loc[:,['instant','dteday','windspeed']]

       instant      dteday  windspeed
0            1  2011-01-01     0.0000
1            2  2011-01-01     0.0000
2            3  2011-01-01     0.0000
3            4  2011-01-01     0.0000
4            5  2011-01-01     0.0000
...        ...         ...        ...
17374    17375  2012-12-31     0.1642
17375    17376  2012-12-31     0.1642
17376    17377  2012-12-31     0.1642
17377    17378  2012-12-31     0.1343
17378    17379  2012-12-31     0.1343

[17379 rows x 3 columns]

Compute and print the overall minimum and maximum of the numeric data columns:

In [62]:
bikes_min, bikes_max = (bikes.min(), bikes.max())
d={'min':bikes_min,'max':bikes_max}
extreme=pd.DataFrame(d)

In [63]:
extreme

                   min         max
instant              1       17379
dteday      2011-01-01  2012-12-31
season               1           4
yr                   0           1
mnth                 1          12
hr                   0          23
holiday              0           1
weekday              0           6
workingday           0           1
weathersit           1           4
temp              0.02         1.0
atemp              0.0         1.0
hum                0.0         1.0
windspeed          0.0      0.8507
casual               0         367
registered           0         886
cnt                  1         977

### Quantiles

Pandas makes computing quantiles easy. This is how to get the median of a Series:

In [ ]:
bikes['atemp'].quantile(0.5)

Of course, the `quantiles` method can take a tuple as its argument. Compute the 10th, 25th, 50th, 75th, and 90th percentiles in one line of code:

In [65]:
#ANSWER
bikes['atemp'].quantile([0.1,0.25,0.5,0.75,0.9])

0.10    0.2424
0.25    0.3333
0.50    0.4848
0.75    0.6212
0.90    0.6970
Name: atemp, dtype: float64

### Cuts

Sometimes we want to split the sample not by the quantiles of the distribution but by the range of the data. Let's take a closer look at `atemp`:

In [ ]:
type(bikes['atemp'])

In [83]:
bikes.sample(5)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,...,hum,windspeed,casual,registered,cnt,cool,chilly,warm,hot,atemp_level
4679,4680,2011-07-18,3,0,7,21,0,1,1,1,...,0.66,0.1940,48,154,202,cool,chilly,warm,hot,warm
3975,3976,2011-06-19,2,0,6,13,0,0,0,2,...,0.51,0.0000,149,214,363,cool,chilly,warm,hot,warm
15595,15596,2012-10-17,4,1,10,0,0,3,1,1,...,0.76,0.0000,1,48,49,cool,chilly,warm,hot,cool
14325,14326,2012-08-25,3,1,8,2,0,6,0,2,...,0.74,0.0896,18,61,79,cool,chilly,warm,hot,warm
7807,7808,2011-11-26,4,0,11,22,0,6,0,2,...,0.76,0.0000,14,51,65,cool,chilly,warm,hot,cool

Suppose we decide to sort these values into 4 bins of equal width, but we want to apply the resulting groups to the entire DataFrame. Basically, we need to add a row label that indcates which bin each sample belongs in. Let's call this label "atemp_level", and use the `cut` method to populate it:

In [87]:
   bikes['atemp_level'] = pd.cut(bikes['atemp'], bins = 4, labels=['chilly','cool','warm','hot'])

What is `atemp_level`?

In [88]:
#ANSWER
bikes.head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt,atemp_level
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16,cool
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40,cool
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32,cool
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13,cool
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1,cool

In [89]:
bikes['atemp_level'].value_counts()

cool      7507
warm      7223
chilly    1952
hot        697
Name: atemp_level, dtype: int64

Here is a random sample of `atemp_level`:

In [96]:
bikes['atemp_level'].sample(10)

15441      warm
1413     chilly
8340     chilly
15049      cool
16585      cool
3665       warm
5008        hot
5600       warm
10514      cool
9737       cool
Name: atemp_level, dtype: category
Categories (4, object): ['chilly' < 'cool' < 'warm' < 'hot']

So, by default, `cut` produces labels that indicate the bin boundaries for each element in the series it was applied to. Usually, we will specify labels that are appropriate to the discretisation we are applying:

In [97]:
bikes['atemp_level'] = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])
atemp_level.sample(5)

348      cool
3877     warm
11619    warm
6818     warm
9033     cool
Name: atemp, dtype: category
Categories (4, object): ['chilly' < 'cool' < 'warm' < 'hot']

Incorporate the new `atemp_level` column into the `bikes` DataFrame and use it to count the number of "mild" `atemp` entries in `season` 2:

In [107]:
#ANSWER
len(bikes[bikes.atemp_level=='mild'])

7507

*Nb. The `atemp_level` variable we created is what the R language calls a "factor". Pandas has introduced a new data type called "category" that is similar to R's factors.*

# Synthetic Data

Sometimes we may want to generate test data, or we may need to initalise a series, matrix, or data frame for input to an algorithm. Numpy has several methods we can use for this.

Execute the following, then check the shape and content of each variable:

In [ ]:
# Creating arrays with initial values
a = np.zeros((3))
b = np.ones((1,3))
c = np.random.randint(1,10,(2,3,4))   # randint(low, high, size)
d = np.arange(4)
e = np.array( [[1,2,3,4], [5,6,7,8]] )

In [ ]:
# Cleaning Data

## Load Data

Load rock.csv and clean the dataset.

In [168]:
rock=pd.read_csv(r'~\Documents\IOD-testing\DATA\rock.csv')
rock

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,She Loves My Automobile,ZZ Top,NaN,She Loves My Automobile by ZZ Top,1,0,1,0
2226,Tube Snake Boogie,ZZ Top,1981,Tube Snake Boogie by ZZ Top,1,1,32,32
2227,Tush,ZZ Top,1975,Tush by ZZ Top,1,1,109,109
2228,TV Dinners,ZZ Top,1983,TV Dinners by ZZ Top,1,1,1,1
2229,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO,ZZ Top,1973,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2

In [169]:
rock.columns=rock.columns.str.lower().str.replace(' ','_').str.replace('?','').str.replace('*','')

C:\Users\nhivo\AppData\Local\Temp\ipykernel_16400\3949958314.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  rock.columns=rock.columns.str.lower().str.replace(' ','_').str.replace('?','').str.replace('*','')
C:\Users\nhivo\AppData\Local\Temp\ipykernel_16400\3949958314.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  rock.columns=rock.columns.str.lower().str.replace(' ','_').str.replace('?','').str.replace('*','')

In [170]:
rock

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,She Loves My Automobile,ZZ Top,NaN,She Loves My Automobile by ZZ Top,1,0,1,0
2226,Tube Snake Boogie,ZZ Top,1981,Tube Snake Boogie by ZZ Top,1,1,32,32
2227,Tush,ZZ Top,1975,Tush by ZZ Top,1,1,109,109
2228,TV Dinners,ZZ Top,1983,TV Dinners by ZZ Top,1,1,1,1
2229,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO,ZZ Top,1973,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2

## Check Column Names

Check column names and clean.

In [141]:
rock.columns

Index(['song_clean', 'artist_clean', 'release_year', 'combined', 'first',
       'year', 'playcount', 'fg'],
      dtype='object')

## Replace Null Values With 0

Check 'release' column whether this column have any null value or not. Replace null value with 0.

In [171]:
rock['release_year'].isnull().sum()

577

In [172]:
rock['release_year']=rock['release_year'].fillna(0)

## Check Min, Max of Each Column

Is there any illogical value in any column? How can we fix that?

In [173]:
rock.dtypes

song_clean      object
artist_clean    object
release_year    object
combined        object
first            int64
year             int64
playcount        int64
fg               int64
dtype: object

In [174]:
rock['release_year'].value_counts()

0                577
1973             104
1977              83
1975              83
1970              81
1971              75
1969              72
1980              70
1978              64
1979              63
1981              61
1967              61
1983              60
1976              56
1982              54
1984              51
1972              50
1974              48
1968              46
1985              39
1987              39
1986              37
1991              34
1989              32
1966              30
1988              29
1965              28
1994              25
1990              22
1993              19
1964              14
1992              14
1999              13
1995              10
1997               9
1963               9
1996               9
1998               6
2002               6
2005               5
2004               5
2012               5
2001               4
2007               3
1962               3
2000               3
2011               3
2003               3
2008               3
2014               2
2013               2
2006               1
SONGFACTS.COM      1
1071               1
1958               1
1955               1
1961               1
Name: release_year, dtype: int64

In [175]:
rock.loc[rock.release_year=='SONGFACTS.COM','release_year']=0

In [182]:
rock['release_year'].value_counts()

0       578
1973    104
1977     83
1975     83
1970     81
1971     75
1969     72
1980     70
1978     64
1979     63
1981     61
1967     61
1983     60
1976     56
1982     54
1984     51
1972     50
1974     48
1968     46
1985     39
1987     39
1986     37
1991     34
1989     32
1966     30
1988     29
1965     28
1994     25
1990     22
1993     19
1964     14
1992     14
1999     13
1995     10
1996      9
1997      9
1963      9
2002      6
1998      6
2005      5
2004      5
2012      5
2001      4
1962      3
2000      3
2011      3
2003      3
2008      3
2007      3
2013      2
2014      2
2006      1
1958      1
1071      1
1955      1
1961      1
Name: release_year, dtype: int64

In [193]:
rock.loc[rock.release_year=='1071','release_year']=0

In [194]:
rock.release_year.value_counts()

0       579
1973    104
1977     83
1975     83
1970     81
1971     75
1969     72
1980     70
1978     64
1979     63
1981     61
1967     61
1983     60
1976     56
1982     54
1984     51
1972     50
1974     48
1968     46
1987     39
1985     39
1986     37
1991     34
1989     32
1966     30
1988     29
1965     28
1994     25
1990     22
1993     19
1992     14
1964     14
1999     13
1995     10
1963      9
1997      9
1996      9
2002      6
1998      6
2004      5
2012      5
2005      5
2001      4
2003      3
2000      3
2011      3
2007      3
1962      3
2008      3
2013      2
2014      2
1958      1
2006      1
1955      1
1961      1
Name: release_year, dtype: int64

In [203]:
rock['release_year']=pd.to_numeric(rock['release_year'])

In [206]:
min,max=(rock.min(numeric_only=True),rock.max(numeric_only=True))
d={'min':min,'max':max}
pd.DataFrame(d)

              min   max
release_year    0  2014
first           1     1
year            0     1
playcount       0   142
fg              0   142

## Write Some Functions

## Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

## Write a function that converts cells in a DataFrame to float and otherwise replaces them with np.nan

## Apply these functions to your dataset

## Describe the new float-only DataFrame.

>



---



---



> > > > > > > > > © 2022 Institute of Data


---



---